[M_HungryLikeSkag MissionDefinition]
MissionDescription="A bandit named Carlo was mauled by skags who killed him, then devoured the pieces of his gun. On Pandora, this sort of thing happens more frequently than you might think. You will need to kill some more skags in order to find the missing parts of Carlo's gun."
MissionSummary="Kill skags to find the parts of Carlo's gun. "
